Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Банки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНаСервере()
	ОтветСервера = HTTP.Запрос("https://data.egov.uz/apiData/MainData/GetByFile?id=6113bd0fdb32b99538e08991&fileType=1&tableType=1&lang=1");
	СписокБанков = СериализаторJSON.Десериализовать(ОтветСервера);
	Для Каждого БанкЭлемент Из СписокБанков Цикл
		ВыборкаСсылка = Справочники.Банки.НайтиПоКоду(БанкЭлемент.Filialkodi);
		Если ЗначениеЗаполнено(ВыборкаСсылка) Тогда
			ВыборкаОбъект = ВыборкаСсылка.ПолучитьОбъект();
		Иначе
			ВыборкаОбъект = Справочники.Банки.СоздатьЭлемент();
		КонецЕсли;
		
		ВыборкаОбъект.Код = БанкЭлемент.Filialkodi;
		ВыборкаОбъект.Наименование = БанкЭлемент.Filialnomi;
		ВыборкаОбъект.ИНН = БанкЭлемент.STIRRAQAMI;
		ВыборкаОбъект.Адрес = БанкЭлемент.Filialmanzili;
		ВыборкаОбъект.Геолокация = БанкЭлемент.Geolokatsiya;
		ВыборкаОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	
	Элементы.Список.Обновить();
КонецПроцедуры
